cases/00-tutorials/hartmann1d/constant/LaserProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                  
  \\      /  F ield           OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration       Website:  www.openfoam.com
    \\  /    A nd             Version:  v2506
     \\/     M anipulation   
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PhaseFieldProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
lasers
(
    // No lasers required
);
