cases/00-tutorials/hartmann1d/0/H
/*--------------------------------*- C++ -*----------------------------------*\
  =========
  \\      /  F ield           OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration       Website:  www.openfoam.com
    \\  /    A nd             Version:  v2506
     \\/     M anipulation
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "initialValues"
dimensions      [0 -1 0 0 0 0 0];

internalField uniform $H_air ; //(0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    lowerWall
    {
        type            fixedValue;
        value           uniform $H_air;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform $H_air;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }

    // note: front/back
    // {
    //     type            zeroGradient;
    // }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //

