cases/00-tutorials/hartmann1d/0/Laser_boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                                                                    
  \\      /  F ield           OpenFOAM: The Open Source CFD Toolbox            
   \\    /   O peration       v2506                                  
    \\  /    A nd             Web:      www.OpenFOAM.org                       
     \\/     M anipulation                                                     
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
	// frontAndBack
    // {
    //     type        empty;
    //     // type fixedValue;
    //     // value uniform 0; // -1.0;
	// }

    lowerWall
    {
        type fixedValue;
        value uniform 0; // -1.0;
    }

    upperWall
    {
        type fixedValue;
        value uniform 0; // 1.0;
    }

    defaultFaces
    {
        type            empty;
        // type fixedValue;
        // value uniform 0; // -1.0;
    }

    inlet
    {
        $lowerWall;
    }
    
    outlet
    {
        $lowerWall;
    }
}

// ************************************************************************* //
